package hw2;

public class Main {

    /*
             2. Написать метод, которому в качестве параметра передается целое число,
             метод должен напечатать в консоль, положительное ли число передали или отрицательное.
             Замечание: ноль считаем положительным числом.

             3. Написать метод, которому в качестве параметра передается целое число.
             Метод должен вернуть true, если число отрицательное, и вернуть false если положительное.

             4. Написать метод, которому в качестве аргументов передается строка и число,
             метод должен отпечатать в консоль указанную строку, указанное количество раз;

            5. * Написать метод, который определяет, является ли год високосным,
            и возвращает boolean (високосный - true, не високосный - false). Каждый 4-й год является високосным,
            кроме каждого 100-го, при этом каждый 400-й – високосный.
     */
    public static void main(String[] args) {
        System.out.println(checkSumInAte(5, 20));
        System.out.println(checkPositiveWrite(-2));
        System.out.println(checkPositive(10));
        writeStr("hi", 5);
        System.out.println(vesocosYear(400));
    }

    /**
     * метод, принимающий на вход два целых числа и проверяющий,
     * что их сумма лежит в пределах от 10 до 20 (включительно), если да – вернуть true, в противном случае – false.
     */
    public static boolean checkSumInAte(int a, int b) {
        return (a + b > 9 && a + b < 21);
    }


    /**
     * метод, которому в качестве параметра передается целое число,
     * метод должен напечатать в консоль, положительное ли число передали или отрицательное.
     * Замечание: ноль считаем положительным числом.
     */
    public static String checkPositiveWrite(int a) {
        if (a > -1) {
            return "положительное";
        } else {
            return "отрицательное";
        }
    }


    /**
     * метод, которому в качестве параметра передается целое число.
     * Метод должен вернуть true, если число отрицательное, и вернуть false если положительное.
     */
    public static boolean checkPositive(int a) {
        return (a > -1);
    }

    /**
     * метод, которому в качестве аргументов передается строка и число,
     * метод должен отпечатать в консоль указанную строку, указанное количество раз;
     */
    public static void writeStr(String str, int count) {
        for (int i = 0; i < count; i++) {
            System.out.println(str);
        }
    }

    /**
     * метод, который определяет, является ли год високосным,
     * и возвращает boolean (високосный - true, не високосный - false). Каждый 4-й год является високосным,
     * кроме каждого 100-го, при этом каждый 400-й – високосный.
     */
    public static boolean vesocosYear(int year) {

        return ( year % 4 == 0 && year % 100 != 0 || year % 400 == 0);
    }
}
